package com.nju.sphm.Controller;

import android.content.Intent;
import android.os.Bundle;
import android.os.StrictMode;
import android.support.v7.app.ActionBarActivity;
import android.view.Menu;
import android.view.MenuItem;
import android.view.View;
import android.widget.Button;

import com.google.gson.Gson;
import com.lidroid.xutils.ViewUtils;
import com.lidroid.xutils.view.annotation.ViewInject;
import com.lidroid.xutils.view.annotation.event.OnClick;
import com.nju.sphm.Bean.TestFileRowBean;
import com.nju.sphm.Bean.UploadDataBean;
import com.nju.sphm.Controller.CountDownTimerActivity.CountDownTimerActivity;
import com.nju.sphm.Controller.LoginActivity.MainActivity;
import com.nju.sphm.Model.DataHelper.DBManager;
import com.nju.sphm.Model.DataHelper.NetWorkHelper;
import com.nju.sphm.Model.Download.DownloadWorker;
import com.nju.sphm.R;

import java.io.BufferedReader;
import java.io.InputStream;
import java.io.InputStreamReader;
import java.util.ArrayList;


public class TestMainActivity extends ActionBarActivity {

    @ViewInject(R.id.btn1)
    Button clock;
    @ViewInject(R.id.btn2)
    Button countDownClock;
    @ViewInject(R.id.btn3)
    Button db;
    @ViewInject(R.id.btn4)
    Button login;
    @ViewInject(R.id.btn5)
    Button download;
    DBManager dbm;

    @Override

    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_test_main);
        StrictMode.ThreadPolicy policy=new StrictMode.ThreadPolicy.Builder().permitAll().build();
        StrictMode.setThreadPolicy(policy);
        dbm = new DBManager(this);
        ViewUtils.inject(this);
        String ip="http://192.168.204.128:8080";
        NetWorkHelper networkHelper = NetWorkHelper.getInstance();
        networkHelper.setIp(ip);


    }

    private String readip(){
        InputStream input = getResources().openRawResource(R.raw.ipsetting);
        BufferedReader read = new BufferedReader(new InputStreamReader(input));
        String line = "";
        try {
            line=read.readLine();
        }catch (Exception e){
            e.printStackTrace();
        }
        return line;
    }

    @OnClick(R.id.btn2)
    public void btn2(View v) {
        Intent intent = new Intent();
        intent.setClass(this, CountDownTimerActivity.class);
        startActivity(intent);
    }

    @OnClick(R.id.btn1)
    public void btn1(View v) {
        DBManager dbManager = new DBManager(this);
        Gson gson = new Gson();
        String str = "{\"fileName\":\"2014-2015学年国标实际数据\",\"schoolYear\":2014,\"type\":\"国标实际数据\",\"items\":{\"T320115200609110156\":{\"身高\":\"129\",\"体重\":\"24\",\"BMI\":\"14.4\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"971\",\"肺活量_得分\":{\"value\":940,\"level\":\"及格\",\"score\":64},\"肺活量_上等级\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"50米跑\":\"9“85\",\"50米跑_得分\":{\"value\":9.9,\"level\":\"良好\",\"score\":85},\"50米跑_上等级\":{\"value\":9.3,\"level\":\"优秀\",\"score\":90},\"坐位体前屈\":\"7\",\"坐位体前屈_得分\":{\"value\":6.2,\"level\":\"及格\",\"score\":72},\"坐位体前屈_上等级\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"102\",\"一分钟跳绳_得分\":{\"value\":101,\"level\":\"良好\",\"score\":85},\"一分钟跳绳_上等级\":{\"value\":107,\"level\":\"优秀\",\"score\":90},\"国标总分\":80.2,\"国标总分_得分\":{\"score\":80.2,\"level\":\"良好\"}},\"T320115200706200196\":{\"身高\":\"130\",\"体重\":\"33\",\"BMI\":\"19.5\",\"BMI_得分\":{\"score\":80,\"level\":\"超重\"},\"肺活量\":\"980\",\"肺活量_得分\":{\"value\":940,\"level\":\"及格\",\"score\":64},\"肺活量_上等级\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"50米跑\":\"11”58\",\"50米跑_得分\":{\"value\":11.6,\"level\":\"及格\",\"score\":64},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"10\",\"坐位体前屈_得分\":{\"value\":9.5,\"level\":\"及格\",\"score\":78},\"坐位体前屈_上等级\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"60\",\"一分钟跳绳_得分\":{\"value\":60,\"level\":\"及格\",\"score\":70},\"一分钟跳绳_上等级\":{\"value\":95,\"level\":\"良好\",\"score\":80},\"国标总分\":71.8,\"国标总分_得分\":{\"score\":71.8,\"level\":\"及格\"}},\"T320115200607030216\":{\"身高\":\"127\",\"体重\":\"26\",\"BMI\":\"16.1\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1115\",\"肺活量_得分\":{\"value\":1080,\"level\":\"及格\",\"score\":68},\"肺活量_上等级\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"50米跑\":\"10“48\",\"50米跑_得分\":{\"value\":10.6,\"level\":\"及格\",\"score\":74},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"9\",\"坐位体前屈_得分\":{\"value\":8.4,\"level\":\"及格\",\"score\":76},\"坐位体前屈_上等级\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"60\",\"一分钟跳绳_得分\":{\"value\":60,\"level\":\"及格\",\"score\":70},\"一分钟跳绳_上等级\":{\"value\":95,\"level\":\"良好\",\"score\":80},\"国标总分\":76.8,\"国标总分_得分\":{\"score\":76.8,\"level\":\"及格\"}},\"T320115200707200139\":{\"身高\":\"124\",\"体重\":\"26\",\"BMI\":\"16.9\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1104\",\"肺活量_得分\":{\"value\":1080,\"level\":\"及格\",\"score\":68},\"肺活量_上等级\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"50米跑\":\"10“ 84\",\"50米跑_得分\":{\"value\":11,\"level\":\"及格\",\"score\":70},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"12\",\"坐位体前屈_得分\":{\"value\":11.9,\"level\":\"良好\",\"score\":85},\"坐位体前屈_上等级\":{\"value\":13.2,\"level\":\"优秀\",\"score\":90},\"一分钟跳绳\":\"127\",\"一分钟跳绳_得分\":{\"value\":117,\"level\":\"优秀\",\"score\":100},\"一分钟跳绳_上等级\":null,\"国标总分\":84.7,\"国标总分_得分\":{\"score\":84.7,\"level\":\"良好\"}},\"T320115200612310175\":{\"身高\":\"122\",\"体重\":\"26\",\"BMI\":\"17.5\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1602\",\"肺活量_得分\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"肺活量_上等级\":{\"value\":1800,\"level\":\"优秀\",\"score\":90},\"50米跑\":\"10“32\",\"50米跑_得分\":{\"value\":10.4,\"level\":\"及格\",\"score\":76},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"13\",\"坐位体前屈_得分\":{\"value\":11.9,\"level\":\"良好\",\"score\":85},\"坐位体前屈_上等级\":{\"value\":13.2,\"level\":\"优秀\",\"score\":90},\"一分钟跳绳\":\"116\",\"一分钟跳绳_得分\":{\"value\":112,\"level\":\"优秀\",\"score\":95},\"一分钟跳绳_上等级\":null,\"国标总分\":86.7,\"国标总分_得分\":{\"score\":86.7,\"level\":\"良好\"}},\"T320115200611180217\":{\"身高\":\"129\",\"体重\":\"37\",\"BMI\":\"22.2\",\"BMI_得分\":{\"score\":60,\"level\":\"肥胖\"},\"肺活量\":\"1503\",\"肺活量_得分\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"肺活量_上等级\":{\"value\":1800,\"level\":\"优秀\",\"score\":90},\"50米跑\":\"10”95\",\"50米跑_得分\":{\"value\":11,\"level\":\"及格\",\"score\":70},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"4\",\"坐位体前屈_得分\":{\"value\":4,\"level\":\"及格\",\"score\":68},\"坐位体前屈_上等级\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"72\",\"一分钟跳绳_得分\":{\"value\":67,\"level\":\"及格\",\"score\":72},\"一分钟跳绳_上等级\":{\"value\":95,\"level\":\"良好\",\"score\":80},\"国标总分\":69.8,\"国标总分_得分\":{\"score\":69.8,\"level\":\"及格\"}},\"T320115200611110219\":{\"身高\":\"133\",\"体重\":\"34\",\"BMI\":\"19.2\",\"BMI_得分\":{\"score\":80,\"level\":\"超重\"},\"肺活量\":\"972\",\"肺活量_得分\":{\"value\":940,\"level\":\"及格\",\"score\":64},\"肺活量_上等级\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"50米跑\":\"11“30\",\"50米跑_得分\":{\"value\":11.4,\"level\":\"及格\",\"score\":66},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"10\",\"坐位体前屈_得分\":{\"value\":9.5,\"level\":\"及格\",\"score\":78},\"坐位体前屈_上等级\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"88\",\"一分钟跳绳_得分\":{\"value\":88,\"level\":\"及格\",\"score\":78},\"一分钟跳绳_上等级\":{\"value\":95,\"level\":\"良好\",\"score\":80},\"国标总分\":73.8,\"国标总分_得分\":{\"score\":73.8,\"level\":\"及格\"}},\"T320115200704210112\":{\"身高\":\"127\",\"体重\":\"32\",\"BMI\":\"19.8\",\"BMI_得分\":{\"score\":80,\"level\":\"超重\"},\"肺活量\":\"1520\",\"肺活量_得分\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"肺活量_上等级\":{\"value\":1800,\"level\":\"优秀\",\"score\":90},\"50米跑\":\"11”57\",\"50米跑_得分\":{\"value\":11.6,\"level\":\"及格\",\"score\":64},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"2\",\"坐位体前屈_得分\":{\"value\":1.8,\"level\":\"及格\",\"score\":64},\"坐位体前屈_上等级\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"106\",\"一分钟跳绳_得分\":{\"value\":101,\"level\":\"良好\",\"score\":85},\"一分钟跳绳_上等级\":{\"value\":107,\"level\":\"优秀\",\"score\":90},\"国标总分\":73,\"国标总分_得分\":{\"score\":73,\"level\":\"及格\"}},\"T320115200612230212\":{\"身高\":\"131\",\"体重\":\"28\",\"BMI\":\"16.3\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1619\",\"肺活量_得分\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"肺活量_上等级\":{\"value\":1800,\"level\":\"优秀\",\"score\":90},\"50米跑\":\"11“14\",\"50米跑_得分\":{\"value\":11.2,\"level\":\"及格\",\"score\":68},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"10\",\"坐位体前屈_得分\":{\"value\":9.5,\"level\":\"及格\",\"score\":78},\"坐位体前屈_上等级\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"81\",\"一分钟跳绳_得分\":{\"value\":81,\"level\":\"及格\",\"score\":76},\"一分钟跳绳_上等级\":{\"value\":95,\"level\":\"良好\",\"score\":80},\"国标总分\":79.2,\"国标总分_得分\":{\"score\":79.2,\"level\":\"及格\"}},\"T320115200707010239\":{\"身高\":\"125\",\"体重\":\"25\",\"BMI\":\"16\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1346\",\"肺活量_得分\":{\"value\":1290,\"level\":\"及格\",\"score\":74},\"肺活量_上等级\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"50米跑\":\"11”65\",\"50米跑_得分\":{\"value\":11.8,\"level\":\"及格\",\"score\":62},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"8\",\"坐位体前屈_得分\":{\"value\":7.3,\"level\":\"及格\",\"score\":74},\"坐位体前屈_上等级\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"129\",\"一分钟跳绳_得分\":{\"value\":117,\"level\":\"优秀\",\"score\":100},\"一分钟跳绳_上等级\":null,\"国标总分\":80.7,\"国标总分_得分\":{\"score\":80.7,\"level\":\"良好\"}},\"T320115200704120133\":{\"身高\":\"125\",\"体重\":\"23\",\"BMI\":\"14.7\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1025\",\"肺活量_得分\":{\"value\":1010,\"level\":\"及格\",\"score\":66},\"肺活量_上等级\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"50米跑\":\"10“2\",\"50米跑_得分\":{\"value\":10.2,\"level\":\"及格\",\"score\":78},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"9\",\"坐位体前屈_得分\":{\"value\":8.4,\"level\":\"及格\",\"score\":76},\"坐位体前屈_上等级\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"74\",\"一分钟跳绳_得分\":{\"value\":74,\"level\":\"及格\",\"score\":74},\"一分钟跳绳_上等级\":{\"value\":95,\"level\":\"良好\",\"score\":80},\"国标总分\":78.1,\"国标总分_得分\":{\"score\":78.1,\"level\":\"及格\"}},\"T320115200609040178\":{\"身高\":\"125\",\"体重\":\"24\",\"BMI\":\"15.4\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"903\",\"肺活量_得分\":{\"value\":870,\"level\":\"及格\",\"score\":62},\"肺活量_上等级\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"50米跑\":\"10”42\",\"50米跑_得分\":{\"value\":10.6,\"level\":\"及格\",\"score\":74},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"7\",\"坐位体前屈_得分\":{\"value\":6.2,\"level\":\"及格\",\"score\":72},\"坐位体前屈_上等级\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"106\",\"一分钟跳绳_得分\":{\"value\":101,\"level\":\"良好\",\"score\":85},\"一分钟跳绳_上等级\":{\"value\":107,\"level\":\"优秀\",\"score\":90},\"国标总分\":77.7,\"国标总分_得分\":{\"score\":77.7,\"level\":\"及格\"}},\"T320115200703030179\":{\"身高\":\"130\",\"体重\":\"29\",\"BMI\":\"17.2\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1410\",\"肺活量_得分\":{\"value\":1360,\"level\":\"及格\",\"score\":76},\"肺活量_上等级\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"50米跑\":\"10“06\",\"50米跑_得分\":{\"value\":10.2,\"level\":\"及格\",\"score\":78},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"6\",\"坐位体前屈_得分\":{\"value\":5.1,\"level\":\"及格\",\"score\":70},\"坐位体前屈_上等级\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"92\",\"一分钟跳绳_得分\":{\"value\":88,\"level\":\"及格\",\"score\":78},\"一分钟跳绳_上等级\":{\"value\":95,\"level\":\"良好\",\"score\":80},\"国标总分\":78.6,\"国标总分_得分\":{\"score\":78.6,\"level\":\"及格\"}},\"T320115200706300218\":{\"身高\":\"118\",\"体重\":\"25\",\"BMI\":\"18\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1056\",\"肺活量_得分\":{\"value\":1010,\"level\":\"及格\",\"score\":66},\"肺活量_上等级\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"50米跑\":\"11”13\",\"50米跑_得分\":{\"value\":11.2,\"level\":\"及格\",\"score\":68},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"14\",\"坐位体前屈_得分\":{\"value\":13.2,\"level\":\"优秀\",\"score\":90},\"坐位体前屈_上等级\":null,\"一分钟跳绳\":\"74\",\"一分钟跳绳_得分\":{\"value\":74,\"level\":\"及格\",\"score\":74},\"一分钟跳绳_上等级\":{\"value\":95,\"level\":\"良好\",\"score\":80},\"国标总分\":80.3,\"国标总分_得分\":{\"score\":80.3,\"level\":\"良好\"}},\"T320115200610100158\":{\"身高\":\"123\",\"体重\":\"22\",\"BMI\":\"14.5\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1388\",\"肺活量_得分\":{\"value\":1360,\"level\":\"及格\",\"score\":76},\"肺活量_上等级\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"50米跑\":\"10“17\",\"50米跑_得分\":{\"value\":10.2,\"level\":\"及格\",\"score\":78},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"7\",\"坐位体前屈_得分\":{\"value\":6.2,\"level\":\"及格\",\"score\":72},\"坐位体前屈_上等级\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"65\",\"一分钟跳绳_得分\":{\"value\":60,\"level\":\"及格\",\"score\":70},\"一分钟跳绳_上等级\":{\"value\":95,\"level\":\"良好\",\"score\":80},\"国标总分\":77.6,\"国标总分_得分\":{\"score\":77.6,\"level\":\"及格\"}},\"T320115200707160376\":{\"身高\":\"127\",\"体重\":\"25\",\"BMI\":\"15.5\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1106\",\"肺活量_得分\":{\"value\":1080,\"level\":\"及格\",\"score\":68},\"肺活量_上等级\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"50米跑\":\"10”05\",\"50米跑_得分\":{\"value\":10.2,\"level\":\"及格\",\"score\":78},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"11\",\"坐位体前屈_得分\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"坐位体前屈_上等级\":{\"value\":13.2,\"level\":\"优秀\",\"score\":90},\"一分钟跳绳\":\"124\",\"一分钟跳绳_得分\":{\"value\":117,\"level\":\"优秀\",\"score\":100},\"一分钟跳绳_上等级\":null,\"国标总分\":84.8,\"国标总分_得分\":{\"score\":84.8,\"level\":\"良好\"}},\"T320115200701060358\":{\"身高\":\"123\",\"体重\":\"24\",\"BMI\":\"15.9\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1081\",\"肺活量_得分\":{\"value\":1080,\"level\":\"及格\",\"score\":68},\"肺活量_上等级\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"50米跑\":\"10“72\",\"50米跑_得分\":{\"value\":10.8,\"level\":\"及格\",\"score\":72},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"9\",\"坐位体前屈_得分\":{\"value\":8.4,\"level\":\"及格\",\"score\":76},\"坐位体前屈_上等级\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"63\",\"一分钟跳绳_得分\":{\"value\":60,\"level\":\"及格\",\"score\":70},\"一分钟跳绳_上等级\":{\"value\":95,\"level\":\"良好\",\"score\":80},\"国标总分\":76.4,\"国标总分_得分\":{\"score\":76.4,\"level\":\"及格\"}},\"T320115200704220097\":{\"身高\":\"134\",\"体重\":\"48\",\"BMI\":\"26.7\",\"BMI_得分\":{\"score\":60,\"level\":\"肥胖\"},\"肺活量\":\"1741\",\"肺活量_得分\":{\"value\":1650,\"level\":\"良好\",\"score\":85},\"肺活量_上等级\":{\"value\":1800,\"level\":\"优秀\",\"score\":90},\"50米跑\":\"11”58\",\"50米跑_得分\":{\"value\":11.6,\"level\":\"及格\",\"score\":64},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"11\",\"坐位体前屈_得分\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"坐位体前屈_上等级\":{\"value\":13.2,\"level\":\"优秀\",\"score\":90},\"一分钟跳绳\":\"75\",\"一分钟跳绳_得分\":{\"value\":74,\"level\":\"及格\",\"score\":74},\"一分钟跳绳_上等级\":{\"value\":95,\"level\":\"良好\",\"score\":80},\"国标总分\":73.4,\"国标总分_得分\":{\"score\":73.4,\"level\":\"及格\"}},\"T320115200704170130\":{\"身高\":\"128\",\"体重\":\"27\",\"BMI\":\"16.5\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1185\",\"肺活量_得分\":{\"value\":1150,\"level\":\"及格\",\"score\":70},\"肺活量_上等级\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"50米跑\":\"11“87\",\"50米跑_得分\":{\"value\":12,\"level\":\"及格\",\"score\":60},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"12\",\"坐位体前屈_得分\":{\"value\":11.9,\"level\":\"良好\",\"score\":85},\"坐位体前屈_上等级\":{\"value\":13.2,\"level\":\"优秀\",\"score\":90},\"一分钟跳绳\":\"65\",\"一分钟跳绳_得分\":{\"value\":60,\"level\":\"及格\",\"score\":70},\"一分钟跳绳_上等级\":{\"value\":95,\"level\":\"良好\",\"score\":80},\"国标总分\":77,\"国标总分_得分\":{\"score\":77,\"level\":\"及格\"}},\"T320115200704260339\":{\"身高\":\"117\",\"体重\":\"21\",\"BMI\":\"15.3\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"890\",\"肺活量_得分\":{\"value\":870,\"level\":\"及格\",\"score\":62},\"肺活量_上等级\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"50米跑\":\"11”88\",\"50米跑_得分\":{\"value\":12,\"level\":\"及格\",\"score\":60},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"6\",\"坐位体前屈_得分\":{\"value\":5.1,\"level\":\"及格\",\"score\":70},\"坐位体前屈_上等级\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"95\",\"一分钟跳绳_得分\":{\"value\":95,\"level\":\"良好\",\"score\":80},\"一分钟跳绳_上等级\":{\"value\":107,\"level\":\"优秀\",\"score\":90},\"国标总分\":73.3,\"国标总分_得分\":{\"score\":73.3,\"level\":\"及格\"}},\"T320115200610040271\":{\"身高\":\"129\",\"体重\":\"29\",\"BMI\":\"17.4\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1501\",\"肺活量_得分\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"肺活量_上等级\":{\"value\":1800,\"level\":\"优秀\",\"score\":90},\"50米跑\":\"10”41\",\"50米跑_得分\":{\"value\":10.6,\"level\":\"及格\",\"score\":74},\"50米跑_上等级\":{\"value\":10,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"8\",\"坐位体前屈_得分\":{\"value\":7.3,\"level\":\"及格\",\"score\":74},\"坐位体前屈_上等级\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"89\",\"一分钟跳绳_得分\":{\"value\":88,\"level\":\"及格\",\"score\":78},\"一分钟跳绳_上等级\":{\"value\":95,\"level\":\"良好\",\"score\":80},\"国标总分\":79.6,\"国标总分_得分\":{\"score\":79.6,\"level\":\"及格\"}},\"T320115200609180218\":{\"身高\":\"135\",\"体重\":\"32\",\"BMI\":\"17.6\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1167\",\"肺活量_得分\":{\"value\":1150,\"level\":\"及格\",\"score\":70},\"肺活量_上等级\":{\"value\":1500,\"level\":\"良好\",\"score\":80},\"50米跑\":\"12”14\",\"50米跑_得分\":{\"value\":12.2,\"level\":\"不及格\",\"score\":50},\"50米跑_上等级\":{\"value\":12,\"level\":\"及格\",\"score\":60},\"坐位体前屈\":\"3\",\"坐位体前屈_得分\":{\"value\":2.9,\"level\":\"及格\",\"score\":66},\"坐位体前屈_上等级\":{\"value\":10.6,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"95\",\"一分钟跳绳_得分\":{\"value\":95,\"level\":\"良好\",\"score\":80},\"一分钟跳绳_上等级\":{\"value\":107,\"level\":\"优秀\",\"score\":90},\"国标总分\":71.3,\"国标总分_得分\":{\"score\":71.3,\"level\":\"及格\"}},\"T32011520070710012X\":{\"身高\":\"126\",\"体重\":\"35\",\"BMI\":\"22\",\"BMI_得分\":{\"score\":60,\"level\":\"肥胖\"},\"肺活量\":\"1189\",\"肺活量_得分\":{\"value\":1150,\"level\":\"及格\",\"score\":78},\"肺活量_上等级\":{\"value\":1200,\"level\":\"良好\",\"score\":80},\"50米跑\":\"13“18\",\"50米跑_得分\":{\"value\":13.2,\"level\":\"不及格\",\"score\":40},\"50米跑_上等级\":{\"value\":12.8,\"level\":\"及格\",\"score\":60},\"坐位体前屈\":\"13\",\"坐位体前屈_得分\":{\"value\":12.2,\"level\":\"及格\",\"score\":78},\"坐位体前屈_上等级\":{\"value\":13.3,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"95\",\"一分钟跳绳_得分\":{\"value\":90,\"level\":\"及格\",\"score\":78},\"一分钟跳绳_上等级\":{\"value\":97,\"level\":\"良好\",\"score\":80},\"国标总分\":67.7,\"国标总分_得分\":{\"score\":67.7,\"level\":\"及格\"}},\"T320115200612090168\":{\"身高\":\"135\",\"体重\":\"31\",\"BMI\":\"17\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"712\",\"肺活量_得分\":{\"value\":700,\"level\":\"及格\",\"score\":60},\"肺活量_上等级\":{\"value\":1200,\"level\":\"良好\",\"score\":80},\"50米跑\":\"10”62\",\"50米跑_得分\":{\"value\":10.8,\"level\":\"良好\",\"score\":80},\"50米跑_上等级\":{\"value\":10.2,\"level\":\"优秀\",\"score\":90},\"坐位体前屈\":\"10\",\"坐位体前屈_得分\":{\"value\":10,\"level\":\"及格\",\"score\":74},\"坐位体前屈_上等级\":{\"value\":13.3,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"106\",\"一分钟跳绳_得分\":{\"value\":105,\"level\":\"良好\",\"score\":85},\"一分钟跳绳_上等级\":{\"value\":113,\"level\":\"优秀\",\"score\":90},\"国标总分\":79.2,\"国标总分_得分\":{\"score\":79.2,\"level\":\"及格\"}},\"T320115200708240247\":{\"身高\":\"125\",\"体重\":\"22\",\"BMI\":\"14.1\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1460\",\"肺活量_得分\":{\"value\":1400,\"level\":\"优秀\",\"score\":90},\"肺活量_上等级\":null,\"50米跑\":\"10“37\",\"50米跑_得分\":{\"value\":10.5,\"level\":\"良好\",\"score\":85},\"50米跑_上等级\":{\"value\":10.2,\"level\":\"优秀\",\"score\":90},\"坐位体前屈\":\"7\",\"坐位体前屈_得分\":{\"value\":6.7,\"level\":\"及格\",\"score\":68},\"坐位体前屈_上等级\":{\"value\":13.3,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"90\",\"一分钟跳绳_得分\":{\"value\":90,\"level\":\"及格\",\"score\":78},\"一分钟跳绳_上等级\":{\"value\":97,\"level\":\"良好\",\"score\":80},\"国标总分\":81.5,\"国标总分_得分\":{\"score\":81.5,\"level\":\"良好\"}},\"T320115200612280308\":{\"身高\":\"130\",\"体重\":\"31\",\"BMI\":\"18.3\",\"BMI_得分\":{\"score\":80,\"level\":\"超重\"},\"肺活量\":\"904\",\"肺活量_得分\":{\"value\":900,\"level\":\"及格\",\"score\":68},\"肺活量_上等级\":{\"value\":1200,\"level\":\"良好\",\"score\":80},\"50米跑\":\"11”74\",\"50米跑_得分\":{\"value\":11.8,\"level\":\"及格\",\"score\":70},\"50米跑_上等级\":{\"value\":10.8,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"15\",\"坐位体前屈_得分\":{\"value\":14.8,\"level\":\"良好\",\"score\":85},\"坐位体前屈_上等级\":{\"value\":16.3,\"level\":\"优秀\",\"score\":90},\"一分钟跳绳\":\"101\",\"一分钟跳绳_得分\":{\"value\":97,\"level\":\"良好\",\"score\":80},\"一分钟跳绳_上等级\":{\"value\":113,\"level\":\"优秀\",\"score\":90},\"国标总分\":77.7,\"国标总分_得分\":{\"score\":77.7,\"level\":\"及格\"}},\"T320115200701210029\":{\"身高\":\"132\",\"体重\":\"26\",\"BMI\":\"14.9\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1234\",\"肺活量_得分\":{\"value\":1200,\"level\":\"良好\",\"score\":80},\"肺活量_上等级\":{\"value\":1400,\"level\":\"优秀\",\"score\":90},\"50米跑\":\"10“98\",\"50米跑_得分\":{\"value\":11,\"level\":\"及格\",\"score\":78},\"50米跑_上等级\":{\"value\":10.8,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"6\",\"坐位体前屈_得分\":{\"value\":5.6,\"level\":\"及格\",\"score\":66},\"坐位体前屈_上等级\":{\"value\":13.3,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"70\",\"一分钟跳绳_得分\":{\"value\":69,\"level\":\"及格\",\"score\":72},\"一分钟跳绳_上等级\":{\"value\":97,\"level\":\"良好\",\"score\":80},\"国标总分\":76.8,\"国标总分_得分\":{\"score\":76.8,\"level\":\"及格\"}},\"T320115200705310182\":{\"身高\":\"124\",\"体重\":\"23\",\"BMI\":\"15\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"879\",\"肺活量_得分\":{\"value\":850,\"level\":\"及格\",\"score\":66},\"肺活量_上等级\":{\"value\":1200,\"level\":\"良好\",\"score\":80},\"50米跑\":\"10”86\",\"50米跑_得分\":{\"value\":11,\"level\":\"及格\",\"score\":78},\"50米跑_上等级\":{\"value\":10.8,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"9\",\"坐位体前屈_得分\":{\"value\":8.9,\"level\":\"及格\",\"score\":72},\"坐位体前屈_上等级\":{\"value\":13.3,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"109\",\"一分钟跳绳_得分\":{\"value\":105,\"level\":\"良好\",\"score\":85},\"一分钟跳绳_上等级\":{\"value\":113,\"level\":\"优秀\",\"score\":90},\"国标总分\":79.1,\"国标总分_得分\":{\"score\":79.1,\"level\":\"及格\"}},\"T320115200703060183\":{\"身高\":\"129\",\"体重\":\"25\",\"BMI\":\"15\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1146\",\"肺活量_得分\":{\"value\":1100,\"level\":\"及格\",\"score\":76},\"肺活量_上等级\":{\"value\":1200,\"level\":\"良好\",\"score\":80},\"50米跑\":\"10“68\",\"50米跑_得分\":{\"value\":10.8,\"level\":\"良好\",\"score\":80},\"50米跑_上等级\":{\"value\":10.2,\"level\":\"优秀\",\"score\":90},\"坐位体前屈\":\"10\",\"坐位体前屈_得分\":{\"value\":10,\"level\":\"及格\",\"score\":74},\"坐位体前屈_上等级\":{\"value\":13.3,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"53\",\"一分钟跳绳_得分\":{\"value\":48,\"level\":\"及格\",\"score\":66},\"一分钟跳绳_上等级\":{\"value\":97,\"level\":\"良好\",\"score\":80},\"国标总分\":77.8,\"国标总分_得分\":{\"score\":77.8,\"level\":\"及格\"}},\"T320115200611120185\":{\"身高\":\"122\",\"体重\":\"23\",\"BMI\":\"15.5\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1143\",\"肺活量_得分\":{\"value\":1100,\"level\":\"及格\",\"score\":76},\"肺活量_上等级\":{\"value\":1200,\"level\":\"良好\",\"score\":80},\"50米跑\":\"11”41\",\"50米跑_得分\":{\"value\":11.6,\"level\":\"及格\",\"score\":72},\"50米跑_上等级\":{\"value\":10.8,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"15\",\"坐位体前屈_得分\":{\"value\":14.8,\"level\":\"良好\",\"score\":85},\"坐位体前屈_上等级\":{\"value\":16.3,\"level\":\"优秀\",\"score\":90},\"一分钟跳绳\":\"65\",\"一分钟跳绳_得分\":{\"value\":62,\"level\":\"及格\",\"score\":70},\"一分钟跳绳_上等级\":{\"value\":97,\"level\":\"良好\",\"score\":80},\"国标总分\":80.3,\"国标总分_得分\":{\"score\":80.3,\"level\":\"良好\"}},\"T320115200708310268\":{\"身高\":\"124\",\"体重\":\"24\",\"BMI\":\"15.6\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"1550\",\"肺活量_得分\":{\"value\":1500,\"level\":\"优秀\",\"score\":95},\"肺活量_上等级\":null,\"50米跑\":\"11“88\",\"50米跑_得分\":{\"value\":12,\"level\":\"及格\",\"score\":68},\"50米跑_上等级\":{\"value\":10.8,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"13\",\"坐位体前屈_得分\":{\"value\":12.2,\"level\":\"及格\",\"score\":78},\"坐位体前屈_上等级\":{\"value\":13.3,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"129\",\"一分钟跳绳_得分\":{\"value\":127,\"level\":\"优秀\",\"score\":100},\"一分钟跳绳_上等级\":null,\"国标总分\":86.3,\"国标总分_得分\":{\"score\":86.3,\"level\":\"良好\"}},\"T320115200704290124\":{\"身高\":\"123\",\"体重\":\"26\",\"BMI\":\"17.2\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"709\",\"肺活量_得分\":{\"value\":700,\"level\":\"及格\",\"score\":60},\"肺活量_上等级\":{\"value\":1200,\"level\":\"良好\",\"score\":80},\"50米跑\":\"11”2\",\"50米跑_得分\":{\"value\":11.2,\"level\":\"及格\",\"score\":76},\"50米跑_上等级\":{\"value\":10.8,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"10\",\"坐位体前屈_得分\":{\"value\":10,\"level\":\"及格\",\"score\":74},\"坐位体前屈_上等级\":{\"value\":13.3,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"78\",\"一分钟跳绳_得分\":{\"value\":76,\"level\":\"及格\",\"score\":74},\"一分钟跳绳_上等级\":{\"value\":97,\"level\":\"良好\",\"score\":80},\"国标总分\":76.2,\"国标总分_得分\":{\"score\":76.2,\"level\":\"及格\"}},\"T320115200702150187\":{\"身高\":\"129\",\"体重\":\"25\",\"BMI\":\"15\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"775\",\"肺活量_得分\":{\"value\":750,\"level\":\"及格\",\"score\":62},\"肺活量_上等级\":{\"value\":1200,\"level\":\"良好\",\"score\":80},\"50米跑\":\"11“14\",\"50米跑_得分\":{\"value\":11.2,\"level\":\"及格\",\"score\":76},\"50米跑_上等级\":{\"value\":10.8,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"14\",\"坐位体前屈_得分\":{\"value\":13.3,\"level\":\"良好\",\"score\":80},\"坐位体前屈_上等级\":{\"value\":16.3,\"level\":\"优秀\",\"score\":90},\"一分钟跳绳\":\"109\",\"一分钟跳绳_得分\":{\"value\":105,\"level\":\"良好\",\"score\":85},\"一分钟跳绳_上等级\":{\"value\":113,\"level\":\"优秀\",\"score\":90},\"国标总分\":80.5,\"国标总分_得分\":{\"score\":80.5,\"level\":\"良好\"}},\"T320115200705270141\":{\"身高\":\"139\",\"体重\":\"32\",\"BMI\":\"16.6\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"772\",\"肺活量_得分\":{\"value\":750,\"level\":\"及格\",\"score\":62},\"肺活量_上等级\":{\"value\":1200,\"level\":\"良好\",\"score\":80},\"50米跑\":\"10”75\",\"50米跑_得分\":{\"value\":10.8,\"level\":\"良好\",\"score\":80},\"50米跑_上等级\":{\"value\":10.2,\"level\":\"优秀\",\"score\":90},\"坐位体前屈\":\"14\",\"坐位体前屈_得分\":{\"value\":13.3,\"level\":\"良好\",\"score\":80},\"坐位体前屈_上等级\":{\"value\":16.3,\"level\":\"优秀\",\"score\":90},\"一分钟跳绳\":\"150\",\"一分钟跳绳_得分\":{\"value\":127,\"level\":\"优秀\",\"score\":100},\"一分钟跳绳_上等级\":null,\"国标总分\":84.3,\"国标总分_得分\":{\"score\":84.3,\"level\":\"良好\"}},\"T320115200708300545\":{\"身高\":\"127\",\"体重\":\"28\",\"BMI\":\"17.4\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"887\",\"肺活量_得分\":{\"value\":850,\"level\":\"及格\",\"score\":66},\"肺活量_上等级\":{\"value\":1200,\"level\":\"良好\",\"score\":80},\"50米跑\":\"10“94\",\"50米跑_得分\":{\"value\":11,\"level\":\"及格\",\"score\":78},\"50米跑_上等级\":{\"value\":10.8,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"13\",\"坐位体前屈_得分\":{\"value\":12.2,\"level\":\"及格\",\"score\":78},\"坐位体前屈_上等级\":{\"value\":13.3,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"112\",\"一分钟跳绳_得分\":{\"value\":105,\"level\":\"良好\",\"score\":85},\"一分钟跳绳_上等级\":{\"value\":113,\"level\":\"优秀\",\"score\":90},\"国标总分\":80.9,\"国标总分_得分\":{\"score\":80.9,\"level\":\"良好\"}},\"T320115200701020188\":{\"身高\":\"130\",\"体重\":\"20\",\"BMI\":\"11.8\",\"BMI_得分\":{\"score\":80,\"level\":\"低体重\"},\"肺活量\":\"995\",\"肺活量_得分\":{\"value\":950,\"level\":\"及格\",\"score\":70},\"肺活量_上等级\":{\"value\":1200,\"level\":\"良好\",\"score\":80},\"50米跑\":\"11”91\",\"50米跑_得分\":{\"value\":12,\"level\":\"及格\",\"score\":68},\"50米跑_上等级\":{\"value\":10.8,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"16\",\"坐位体前屈_得分\":{\"value\":14.8,\"level\":\"良好\",\"score\":85},\"坐位体前屈_上等级\":{\"value\":16.3,\"level\":\"优秀\",\"score\":90},\"一分钟跳绳\":\"89\",\"一分钟跳绳_得分\":{\"value\":83,\"level\":\"及格\",\"score\":76},\"一分钟跳绳_上等级\":{\"value\":97,\"level\":\"良好\",\"score\":80},\"国标总分\":76.8,\"国标总分_得分\":{\"score\":76.8,\"level\":\"及格\"}},\"T320115200611090203\":{\"身高\":\"124\",\"体重\":\"29\",\"BMI\":\"18.9\",\"BMI_得分\":{\"score\":80,\"level\":\"超重\"},\"肺活量\":\"837\",\"肺活量_得分\":{\"value\":800,\"level\":\"及格\",\"score\":64},\"肺活量_上等级\":{\"value\":1200,\"level\":\"良好\",\"score\":80},\"50米跑\":\"12“55\",\"50米跑_得分\":{\"value\":12.6,\"level\":\"及格\",\"score\":62},\"50米跑_上等级\":{\"value\":10.8,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"9\",\"坐位体前屈_得分\":{\"value\":8.9,\"level\":\"及格\",\"score\":72},\"坐位体前屈_上等级\":{\"value\":13.3,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"81\",\"一分钟跳绳_得分\":{\"value\":76,\"level\":\"及格\",\"score\":74},\"一分钟跳绳_上等级\":{\"value\":97,\"level\":\"良好\",\"score\":80},\"国标总分\":70.4,\"国标总分_得分\":{\"score\":70.4,\"level\":\"及格\"}},\"T32011520070803016X\":{\"身高\":\"116\",\"体重\":\"20\",\"BMI\":\"14.9\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"730\",\"肺活量_得分\":{\"value\":700,\"level\":\"及格\",\"score\":60},\"肺活量_上等级\":{\"value\":1200,\"level\":\"良好\",\"score\":80},\"50米跑\":\"12”22\",\"50米跑_得分\":{\"value\":12.4,\"level\":\"及格\",\"score\":64},\"50米跑_上等级\":{\"value\":10.8,\"level\":\"良好\",\"score\":80},\"坐位体前屈\":\"13\",\"坐位体前屈_得分\":{\"value\":12.2,\"level\":\"及格\",\"score\":78},\"坐位体前屈_上等级\":{\"value\":13.3,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"102\",\"一分钟跳绳_得分\":{\"value\":97,\"level\":\"良好\",\"score\":80},\"一分钟跳绳_上等级\":{\"value\":113,\"level\":\"优秀\",\"score\":90},\"国标总分\":76.2,\"国标总分_得分\":{\"score\":76.2,\"level\":\"及格\"}},\"T320115200612300241\":{\"身高\":\"127\",\"体重\":\"26\",\"BMI\":\"16.1\",\"BMI_得分\":{\"score\":100,\"level\":\"正常\"},\"肺活量\":\"982\",\"肺活量_得分\":{\"value\":950,\"level\":\"及格\",\"score\":70},\"肺活量_上等级\":{\"value\":1200,\"level\":\"良好\",\"score\":80},\"50米跑\":\"10“56\",\"50米跑_得分\":{\"value\":10.8,\"level\":\"良好\",\"score\":80},\"50米跑_上等级\":{\"value\":10.2,\"level\":\"优秀\",\"score\":90},\"坐位体前屈\":\"7\",\"坐位体前屈_得分\":{\"value\":6.7,\"level\":\"及格\",\"score\":68},\"坐位体前屈_上等级\":{\"value\":13.3,\"level\":\"良好\",\"score\":80},\"一分钟跳绳\":\"108\",\"一分钟跳绳_得分\":{\"value\":105,\"level\":\"良好\",\"score\":85},\"一分钟跳绳_上等级\":{\"value\":113,\"level\":\"优秀\",\"score\":90},\"国标总分\":78.9,\"国标总分_得分\":{\"score\":78.9,\"level\":\"及格\"}}}}";
        UploadDataBean bean = gson.fromJson(str, UploadDataBean.class);
        bean.setOrganizationID("555");
        boolean t = dbManager.addUploadData(bean);
        ArrayList<UploadDataBean> list = dbManager.getUploadDatas("555");
        System.out.println(list.get(0).getItemsJSON());
    }

    @OnClick(R.id.btn3)
    public void btn3(View v) {
        try {
//            Runnable r = new NetWorkHandler();
//            Thread thread = new Thread(r);
//            thread.start();
            //ArrayList<String> list = dao.getClassIdList("5445bd0bfa40c7df3ad57efe");
//            LoginDAO dao = new LoginDAO();
//            ArrayList list= dao.getUsers();
            //db.setText(list.size() + "");
//            TestFileHelper helper = new TestFileHelper();
//            System.out.println(helper.getTestFileRowList("54508151802097dd4e306470").size());
//            StudentHelper helper = new StudentHelper();
//            ArrayList<ClassBean> list = helper.getClassList("/运营服务中心/江苏省/南京市/江宁区/南京市江宁区铜山中心小学/",2014);
//            ArrayList<StudentBean> sl = list.get(1).getStudents();
//            dbm.addStudents(sl);
//            String o = list.get(1).get_id();
//            ArrayList<StudentBean> s2 = dbm.getStudents(o);
//            for(StudentBean bean:s2){
//                System.out.println(bean.getInfoJSON());
//            }
//            OrganizationHelper helper = new OrganizationHelper();
//            ArrayList<OrganizationBean> l = helper.getOrganizationList("/运营服务中心/江苏省/南京市/江宁区/南京市江宁区铜山中心小学/",2014);
//            dbm.addOrganizations(l);
//            int size1=1;
//            int size2=0;
//            for(OrganizationBean b: l){
//                size1+=b.getChildren().size();
//                size2+=dbm.getOrganizations(b.get_id()).size();
//            }
//            System.out.println(size1+";"+size2);

            for(TestFileRowBean b : dbm.getTestFileRows("54508151802097dd4e306470")){
                    System.out.println(b.getInfoJSON());


            }
        }catch (Exception e) {
            e.printStackTrace();
        }
    }

    @OnClick(R.id.btn4)
    public void login(View v){
        Intent intent = new Intent();
        intent.setClass(this, MainActivity.class);
        startActivity(intent);
    }

    @OnClick(R.id.btn5)
    public void download(View v){
        DownloadWorker dw = new DownloadWorker(this.getApplicationContext());
//        boolean success = dw.download("/运营服务中心/江苏省/南京市/江宁区/南京市江宁区铜山中心小学/", "544d9bcc802097dd4e2d0a08", 2014 );
//        if(success){
//
//        }
    }

    @Override
    public boolean onCreateOptionsMenu(Menu menu) {
        // Inflate the menu; this adds items to the action bar if it is present.
        getMenuInflater().inflate(R.menu.menu_main, menu);
        return true;
    }

    @Override
    public boolean onOptionsItemSelected(MenuItem item) {
        // Handle action bar item clicks here. The action bar will
        // automatically handle clicks on the Home/Up button, so long
        // as you specify a parent activity in AndroidManifest.xml.
        int id = item.getItemId();

        //noinspection SimplifiableIfStatement
        if (id == R.id.action_settings) {
            return true;
        }

        return super.onOptionsItemSelected(item);
    }

    private class NetWorkHandler implements Runnable {
     @Override
        public void run() {
            try {

            } catch (Exception e) {
                e.printStackTrace();
            }
        }
    }
}
